_posts/2014-03-11-5xW.html
---
layout: post
title:  Five Ws about Eventorbot-EU
date:   2014-03-11T09:55:40+0100
---

<p>
This blog (what is a blog?) is going to be about my attempt to build a
3d printer.
</p>

<p>
I've been told that the best way for a good start of a successful
project is to make sure you've got all the information you need. The
basic way to gather them is to ask <b>Five Ws</b>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Who?</h2>
<div class="outline-text-2" id="text-1">
<p>
Me. I work as a software engineer and I have always been a software
guy, so hardware hacking like this is quite a challenge for
me. However, I hope the the <i>engineer</i> part will help.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> What?</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://reprap.org/wiki/Eventorbot">Eventorbot</a>. Among many different RepRap designs this one seems to be
the easiest to assemble, or at least I feel it is easiest to identify
possible issues. Compared to other models with frames assembled from
either threaded rods or aluminum profiles it has much less degrees of
freedom hence ways to screw (no pun inteded) up the frame. Although, I
admit that a welder is not as trivial tool as a screw driver or a
wrench.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> When?</h2>
<div class="outline-text-2" id="text-3">
<p>
I hope to print some Christmas prestents this year.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Where?</h2>
<div class="outline-text-2" id="text-4">
<p>
Europe. The original Eventorbot was designed with imperial units in
mind available in the USA. Here, in Europe, we don't have 2"½ steel
square pipes, we've got 60x60 mm ones. Finding 10-32 screws isn't
trivial too and they don't come at dime-a-dozen. This means I need to
redesign some parts.  The other reason is that the original design is
distributed as a Sketchup file which I've got no way to read on my
Linux machine.
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Why?</h2>
<div class="outline-text-2" id="text-5">
<p>
I want to have a 3d printer and after twenty years of software hacking
I'd love to do something completely different. As of now it seems
quite hard for me to take those comfortable shoes off and not send
<a href="https://github.com/openscad/openscad/pull/460">patches</a>. Anyway, learning new software is fun too.
</p>
</div>
</div>
